# PYTHON with SQL

In [ ]:
#connecting MySQL to Python

pip install mysql-connector-python

In [3]:
#importing required libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [ ]:
#user-defined function called create_server_connection() to connect MySQL Server from the Jupyter notebook

def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

pw = "Navya@111" 
db = "orders" 

connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

In [ ]:
#creating mysql_python database by defining a create_database() function

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")

create_database_query = "CREATE DATABASE orders"
create_database(connection, create_database_query)

Database created successfully

In [ ]:
#connecting to the mysql_python database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

MySQL Database connection successful

In [ ]:
#creating a function to execute queries

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

Query successful

#### So far, you saw how to establish the MySQL server connection and create a database. Now, create a table called Orders with seven columns

In [ ]:
create_orders_table = """
CREATE TABLE orders (
  Order_id INT PRIMARY KEY,
  Customer_name VARCHAR(40) NOT NULL,
  Product_name VARCHAR(40) NOT NULL,
  Date_ordered DATE,
  quantity INT,
  Price FLOAT,
  Phone_no VARCHAR(40)
  );
 """

connection = create_db_connection("localhost", "root", pw, db) 
execute_query(connection, create_orders_table)

MySQL Database connection successful

Query successful

In [ ]:
#inserting a few records into the table using the insert command
data_orders = """

INSERT INTO orders VALUES

(101, 'Steve', 'Laptop', '2018-06-12', 2, 800, '6293730802'),

(102, 'Jos', 'Books', '2019-02-10', 10, 12, '8367489124'),

(103, 'Stacy', 'Trousers', '2019-12-25', 5, 50, '8976123645'),

(104, 'Nancy', 'T-Shirts', '2018-07-14', 7, 30, '7368145099'), 

(105, 'Maria', 'Headphones', '2019-05-30', 6, 48, '8865316698'),

(106, 'Danny', 'Smart TV', '2018-08-20', 10, 300, '7720130449');
"""

connection = create_db_connection("localhost", "root", pw, db) 
execute_query(connection, data_orders)

MySQL Database connection successful

Query successful

In [ ]:
#In order to read data from the table, create a read_query function containing the fetchall() method

def read_query(connection, query): 
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print (f"Error: '{err}'")

#### Exploring some of the popular commands to understand SQL with Python in detail.

In [ ]:
ql =""""

SELECT * FROM orders;

""""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1) 
for result in results:
    print(result)

MySQL Database connection successful

(101, 'Steve', 'Laptop', '2018-06-12', 2, 800, '6293730802')
(102, 'Jos', 'Books', '2019-02-10', 10, 12, '8367489124')
(103, 'Stacy', 'Trousers', '2019-12-25', 5, 50, '8976123645')
(104, 'Nancy', 'T-Shirts', '2018-07-14', 7, 30, '7368145099') 
(105, 'Maria', 'Headphones', '2019-05-30', 6, 48, '8865316698')
(106, 'Danny', 'Smart TV', '2018-08-20', 10, 300, '7720130449')

In [ ]:
q2="""

SELECT DISTINCT year(date_ordered) FROM orders;

"""
connection create_db_connection("localhost", "root", pw, db) 
results = read_query(connection, q2)
for result in results:
     print(result)

MySQL Database connection successful

(2018,)
(2019,)

In [ ]:
q3 =""""

SELECT * FROM orders WHERE date_ordered < '2018-12-31';

""""

connection = create_db_connection("localhost", "root", pw, db) 
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL Database connection successful

(101, 'Steve', 'Laptop', '2018-06-12', 2, 800, '6293730802')
(104, 'Nancy', 'T-Shirts', '2018-07-14', 7, 30, '7368145099')
(106, 'Danny', 'Smart TV', '2018-08-20', 10, 300, '7720130449')

In [ ]:
q4 = """"

SELECT * FROM orders ORDER BY unit_price DESC; 

""""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q4) 
for result in results:
    print(result)

MySQL Database connection successful

(102, 'Jos', 'Books', '2019-02-10', 10, 12, '8367489124')
(104, 'Nancy', 'T-Shirts', '2018-07-14', 7, 30, '7368145099')
(105, 'Maria', 'Headphones', '2019-05-30', 6, 48, '8865316698')
(103, 'Stacy', 'Trousers', '2019-12-25', 5, 50, '8976123645')
(106, 'Danny', 'Smart TV', '2018-08-20', 10, 300, '7720130449')
(101, 'Steve', 'Laptop', '2018-06-12', 2, 800, '6293730802')

In [ ]:
#query to update the record

update = """"

UPDATE orders
SET unit_price = 45
WHERE order_id =103;

""""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, update)

MySQL Database connection successful

Query successful

In [ ]:
#query to delete dome of the records

delete_order = """"

DELETE FROM orders
WHERE order_id = 105;

""""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, delete_order)

MySQL Database connection successful

Query successful

#### sample code for creating a Pandas data frame from the existing records in the table. To do this, you can append the result to an empty list, assign the column name, and use the Dataframe() method to build the data frame.

In [ ]:
# db = []
# for result in results:
#     result = list (result)
#     db.append(result)
# cols=["order_id", "customer_name", "product_name", "date_ordered", "quantity", "unit_price", "phone_number"] 
# df = pd.DataFrame(db, columns = cols)
# display (df)